app/views/doctors/_appointments.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 2]]
---
  <tbody>
    <% @doctor.appointments.each do |appointment| %>