app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
  def index
    @appointments = Appointment.all

INSERT INTO "appointments" ("created_at", "customer_id", "date_of_visit", "doctor_id", "pet", "requires_reminder_of_appointment", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

UPDATE "appointments" SET "pet_type" = ?, "breed" = ?, "age" = ?, "weight" = ?, "updated_at" = ? WHERE "appointments"."id" = 1  [["pet_type", "Yah"], ["breed", "dad"], ["age", 23], ["weight", 3], ["updated_at", Wed, 13 Jan 2016 12:38:38 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @appointment.update(appointment_params)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_appointment
      @appointment = Appointment.find(params[:id])