app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("created_at", "date_of_next_appointment", "name", "reason_for_visit", "updated_at") VALUES (?, ?, ?, ?, ?)

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]