app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
---
  def index
    @doctors = Doctor.all

INSERT INTO "doctors" ("address", "city", "created_at", "name", "receptionist", "school_received_degree_from", "state", "updated_at", "years_in_practice", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "address" = ?, "city" = ?, "state" = ?, "zip" = ?, "school_received_degree_from" = ?, "updated_at" = ? WHERE "doctors"."id" = 1
---
  def update
    respond_to do |format|
      if @doctor.update(doctor_params)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def add_or_edit_pet_information
    puts params
    @appointment = Appointment.find(params[:id])

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_doctor
      @doctor = Doctor.find(params[:id])